a = int(input())
b = 2.3
# sep= пробел между двумя строками в print
print('Равно', a+b, sep='-', end='\n')
# end='переменная' указывает, что будет в конце строки и переносит следующий print в одну строку
# end='\n' перенос следующего print на другую строку
print('\tGod')  # \t создает пробел
print(min(1, 2, 3, 4, 5))  # минимальное значение
print(max(1, 2, 3, 4, 5))  # максимальное значение
print(abs(-5))  # модуль
print(pow(5, 3))  # степень (число, степень)
print(round(5/3))  # округление до большего целого
