#Срезы в строковых значениях
name = 'Даниил'
name[1:3]  #Возвращает срез (ан)
name = 'Даниил'
name[:3]  #срез начинается с начала и до (3 места в преременной)(Дан)
name = 'Даниил'
name[1:]  #срез заканчивается в конце пременной(аниил)
name = 'Даниил'
name[:]  #возвращает всю переменную
name = 'Даниил'
name[0:len(name)]  #так же возвращает всю переменную
name = 'Даниил'
name[:4:
     2]  #начинается срез с начала переменной, до (4 места в переменной) с длиной шага 2 (Дн)
name = 'Даниил'
name[-3:]  #отсчитывает от конца 3 символа и начинает писать до конца(иил)